[
  {
    "tempId": 0,
    "sub": "Protocol Overview",
    "text": "XF402 is an open protocol for time-bound rights and access control on digital assets. It extends Coinbase’s x402 payment primitive into a licensing layer for NFTs, tickets, and media."
  },
  {
    "tempId": 1,
    "sub": "Programmable Usage",
    "text": "Instead of permanent, static ownership, XF402 introduces programmable access windows such as 1 hour, 1 day, or 1 week, enforced through wallet-based payment proofs."
  },
  {
    "tempId": 2,
    "sub": "Solana Native",
    "text": "Built for Solana's speed, cost efficiency, and agent economy. XF402 enables high-frequency micro-rentals and real-time access gating with minimal friction."
  },
  {
    "tempId": 3,
    "sub": "Trust-Light Architecture",
    "text": "No asset custody or token wrapping. XF402 uses HTTP 402 payment semantics, verifiable receipts, and optional on-chain anchors to minimize trust without heavy infrastructure."
  },
  {
    "tempId": 4,
    "sub": "Simple Structured JSON",
    "text": "Access tiers, durations, pricing, and rights are defined in a standard R402 JSON schema that can be embedded inside APIs, NFT metadata, or content gateways."
  },
  {
    "tempId": 5,
    "sub": "Developer Toolkit",
    "text": "Includes reference SDKs such as @xf402/r402 for JavaScript and xf402-fastapi for Python. These tools handle x402 and R402 request flows, validation, and client retries automatically."
  },
  {
    "tempId": 6,
    "sub": "Media and IP Licensing",
    "text": "Turn memes, art, and creative works into rentable and remixable digital licenses. Monetize culture without transferring or locking assets."
  },
  {
    "tempId": 7,
    "sub": "Agent-First Payments",
    "text": "Designed for both users and agents. Enables machine-to-machine micro-payments for data, models, assets, and APIs in an autonomous computing environment."
  },
  {
    "tempId": 8,
    "sub": "Drop-In Adoption",
    "text": "Works with any HTTP stack including Next.js, Express, FastAPI, and Cloudflare Workers. No direct RPC access or blockchain custody logic needed to begin."
  },
  {
    "tempId": 9,
    "sub": "Universal Rental Layer",
    "text": "From tickets and gaming assets to premium APIs, XF402 makes digital property dynamic, rentable, and interoperable across applications and ecosystems."
  },
  {
    "tempId": 10,
    "sub": "Cryptographic Access Receipts",
    "text": "Every payment produces a verifiable receipt that proves access within a defined time window. Receipts can be reused across applications and agent systems."
  },
  {
    "tempId": 11,
    "sub": "New Ownership Paradigm",
    "text": "XF402 shifts digital ownership from static possession to permission-based usage. This enables shared access rights, usage-based economics, and collaborative value flows."
  }
]
